// Напишите цикл for для поиска четных и нечетных чисел
// Напишите цикл for, который будет повторяться от 0 до 15.
// Для каждой итерации он будет проверять, является ли текущее число четным или нечетным.

for (let i = 0; i < 15; i++) {
  if (i % 2 === 0) {
    console.log(i, ' - четное');
  } else {
    console.log(i, ' - нечетное');
  }
}

// 0  - четное
// 1  - нечетное
// 2  - четное
// 3  - нечетное
// 4  - четное
// 5  - нечетное
// 6  - четное
// 7  - нечетное
// 8  - четное
// 9  - нечетное
// 10  - четное
// 11  - нечетное
// 12  - четное
// 13  - нечетное
// 14  - четное
